
## Plan Result

[CI link](https://github.com/ogadra/GitHub/actions/runs/23476167483)


<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.repositories.module.cli_demo_20230327.github_actions_secret.cli_demo_20260327[&#34;DEPLOY_BROKER_ROLE_ARN&#34;]
  * module.repositories.module.cli_demo_20230327.github_actions_secret.cli_demo_20260327[&#34;DEPLOY_FRONT_ROLE_ARN&#34;]
  * module.repositories.module.cli_demo_20230327.github_actions_secret.cli_demo_20260327[&#34;DEPLOY_NGINX_ROLE_ARN&#34;]
  * module.repositories.module.cli_demo_20230327.github_actions_secret.cli_demo_20260327[&#34;DEPLOY_RUNNER_ROLE_ARN&#34;]
  * module.repositories.module.cli_demo_20230327.github_actions_secret.cli_demo_20260327[&#34;FRONT_S3_BUCKET&#34;]
  * module.repositories.module.cli_demo_20230327.github_dependabot_secret.cli_demo_20260327[&#34;DEPLOY_BROKER_ROLE_ARN&#34;]
  * module.repositories.module.cli_demo_20230327.github_dependabot_secret.cli_demo_20260327[&#34;DEPLOY_FRONT_ROLE_ARN&#34;]
  * module.repositories.module.cli_demo_20230327.github_dependabot_secret.cli_demo_20260327[&#34;DEPLOY_NGINX_ROLE_ARN&#34;]
  * module.repositories.module.cli_demo_20230327.github_dependabot_secret.cli_demo_20260327[&#34;DEPLOY_RUNNER_ROLE_ARN&#34;]
  * module.repositories.module.cli_demo_20230327.github_dependabot_secret.cli_demo_20260327[&#34;FRONT_S3_BUCKET&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories.module.cli_demo_20230327.github_actions_secret.cli_demo_20260327["DEPLOY_BROKER_ROLE_ARN"] will be created
  + resource "github_actions_secret" "cli_demo_20260327" {
      + created_at        = (known after apply)
      + encrypted_value   = (sensitive value)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + remote_updated_at = (known after apply)
      + repository        = "20260327-cli-demo"
      + repository_id     = (known after apply)
      + secret_name       = "DEPLOY_BROKER_ROLE_ARN"
      + updated_at        = (known after apply)
    }

  # module.repositories.module.cli_demo_20230327.github_actions_secret.cli_demo_20260327["DEPLOY_FRONT_ROLE_ARN"] will be created
  + resource "github_actions_secret" "cli_demo_20260327" {
      + created_at        = (known after apply)
      + encrypted_value   = (sensitive value)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + remote_updated_at = (known after apply)
      + repository        = "20260327-cli-demo"
      + repository_id     = (known after apply)
      + secret_name       = "DEPLOY_FRONT_ROLE_ARN"
      + updated_at        = (known after apply)
    }

  # module.repositories.module.cli_demo_20230327.github_actions_secret.cli_demo_20260327["DEPLOY_NGINX_ROLE_ARN"] will be created
  + resource "github_actions_secret" "cli_demo_20260327" {
      + created_at        = (known after apply)
      + encrypted_value   = (sensitive value)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + remote_updated_at = (known after apply)
      + repository        = "20260327-cli-demo"
      + repository_id     = (known after apply)
      + secret_name       = "DEPLOY_NGINX_ROLE_ARN"
      + updated_at        = (known after apply)
    }

  # module.repositories.module.cli_demo_20230327.github_actions_secret.cli_demo_20260327["DEPLOY_RUNNER_ROLE_ARN"] will be created
  + resource "github_actions_secret" "cli_demo_20260327" {
      + created_at        = (known after apply)
      + encrypted_value   = (sensitive value)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + remote_updated_at = (known after apply)
      + repository        = "20260327-cli-demo"
      + repository_id     = (known after apply)
      + secret_name       = "DEPLOY_RUNNER_ROLE_ARN"
      + updated_at        = (known after apply)
    }

  # module.repositories.module.cli_demo_20230327.github_actions_secret.cli_demo_20260327["FRONT_S3_BUCKET"] will be created
  + resource "github_actions_secret" "cli_demo_20260327" {
      + created_at        = (known after apply)
      + encrypted_value   = (sensitive value)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + remote_updated_at = (known after apply)
      + repository        = "20260327-cli-demo"
      + repository_id     = (known after apply)
      + secret_name       = "FRONT_S3_BUCKET"
      + updated_at        = (known after apply)
    }

  # module.repositories.module.cli_demo_20230327.github_dependabot_secret.cli_demo_20260327["DEPLOY_BROKER_ROLE_ARN"] will be created
  + resource "github_dependabot_secret" "cli_demo_20260327" {
      + created_at        = (known after apply)
      + encrypted_value   = (sensitive value)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + remote_updated_at = (known after apply)
      + repository        = "20260327-cli-demo"
      + repository_id     = (known after apply)
      + secret_name       = "DEPLOY_BROKER_ROLE_ARN"
      + updated_at        = (known after apply)
    }

  # module.repositories.module.cli_demo_20230327.github_dependabot_secret.cli_demo_20260327["DEPLOY_FRONT_ROLE_ARN"] will be created
  + resource "github_dependabot_secret" "cli_demo_20260327" {
      + created_at        = (known after apply)
      + encrypted_value   = (sensitive value)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + remote_updated_at = (known after apply)
      + repository        = "20260327-cli-demo"
      + repository_id     = (known after apply)
      + secret_name       = "DEPLOY_FRONT_ROLE_ARN"
      + updated_at        = (known after apply)
    }

  # module.repositories.module.cli_demo_20230327.github_dependabot_secret.cli_demo_20260327["DEPLOY_NGINX_ROLE_ARN"] will be created
  + resource "github_dependabot_secret" "cli_demo_20260327" {
      + created_at        = (known after apply)
      + encrypted_value   = (sensitive value)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + remote_updated_at = (known after apply)
      + repository        = "20260327-cli-demo"
      + repository_id     = (known after apply)
      + secret_name       = "DEPLOY_NGINX_ROLE_ARN"
      + updated_at        = (known after apply)
    }

  # module.repositories.module.cli_demo_20230327.github_dependabot_secret.cli_demo_20260327["DEPLOY_RUNNER_ROLE_ARN"] will be created
  + resource "github_dependabot_secret" "cli_demo_20260327" {
      + created_at        = (known after apply)
      + encrypted_value   = (sensitive value)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + remote_updated_at = (known after apply)
      + repository        = "20260327-cli-demo"
      + repository_id     = (known after apply)
      + secret_name       = "DEPLOY_RUNNER_ROLE_ARN"
      + updated_at        = (known after apply)
    }

  # module.repositories.module.cli_demo_20230327.github_dependabot_secret.cli_demo_20260327["FRONT_S3_BUCKET"] will be created
  + resource "github_dependabot_secret" "cli_demo_20260327" {
      + created_at        = (known after apply)
      + encrypted_value   = (sensitive value)
      + id                = (known after apply)
      + key_id            = (known after apply)
      + remote_updated_at = (known after apply)
      + repository        = "20260327-cli-demo"
      + repository_id     = (known after apply)
      + secret_name       = "FRONT_S3_BUCKET"
      + updated_at        = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":23,"Program":"tfcmt","SHA1":"dfc1d4f08853d2aa65363f556915e2b9257afd0f","Vars":{},"WorkflowName":"Plan"} -->